app/controllers/bids_controller.rb

	def create
		@bid = current_user.bids.new(bid_params)
		@bid.user_id = current_user.id
		@bid.quote_id = params[:quote_id]

	    respond_to do |format|
	      if @bid.save
---
INSERT INTO "bids" ("description", "amount", "name", "user_id", "quote_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def index
		@bids = current_user.bids.order("id DESC")
---
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = $1  ORDER BY id DESC  [["user_id", 1]]

	def set_bid
		@bid = Bid.find(params[:id])
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT 1  [["id", 2]]

	def set_quote
		@quote = Quote.find_by_id(params[:quote_id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT 1  [["id", 3]]