app/controllers/comments_controller.rb

  def create
  	@comment = @commentable.comments.new(comment_params)
  	@comment.user = current_user
    if @comment.save
---
INSERT INTO "comments" ("content", "commentable_id", "commentable_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Ooh la la"], ["commentable_id", 2], ["commentable_type", "Bid"], ["user_id", 1], ["created_at", "2015-05-19 11:25:36.603603"], ["updated_at", "2015-05-19 11:25:36.603603"]]