app/controllers/profiles_controller.rb

    def set_profile
      @profile = Profile.friendly.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 0]]