app/controllers/quotes_controller.rb

INSERT INTO "quotes" ("email", "name", "field", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "I want a caterer"], ["name", "Carlos Solorio"], ["field", "Wedding"], ["location", "Phoenix"], ["created_at", "2015-05-19 08:09:47.313274"], ["updated_at", "2015-05-19 08:09:47.313274"]]
---
	def create
		if current_user
			@quote = current_user.quotes.new(quote_params)
			@quote.user_id = current_user.id
			@quote.email = current_user.email
		else
			@quote = Quote.new(quote_params)
		end
u
	    respond_to do |format|
	      if @quote.save

SELECT "quotes".* FROM "quotes"  ORDER BY id DESC
---
	def index
		@quotes = Quote.order("id DESC").all

SELECT  "quotes".* FROM "quotes" WHERE "quotes"."user_id" = $1  ORDER BY "quotes"."id" DESC LIMIT 1  [["user_id", 2]]
---
	def quote
		if signed_in?
			if current_user.quotes.last.present?